AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/омПроцедурыИФункции/Ext/Module.bsl
// http://infostart.ru/public/78455/

Функция обДополнитьСтроку(Знач Парам, Длина, Символ = "0", Режим = 0) Экспорт
	
	// пример обДополнитьСтроку(2, 5)
	// параметр - число 2 преобр в строку длиной 5 ==> "00002"
	//
	// пример обДополнитьСтроку(8, 2, " ")
	// ==> " 8"
	
	Парам = ""+Парам;  // превращаем параметр в строку
	Добавить = Длина - СтрДлина(Парам);
	
	Если Добавить > 0  Тогда
		Добавок = "";
		Для Сч = 1 По Добавить Цикл
			Добавок = Добавок + Символ
		КонецЦикла;
		Парам = ?(Режим = 0, Добавок + Парам, Парам + Добавок)
	КонецЕсли;
	
	Возврат	Парам
	
КонецФункции // глДополнитьСтроку()

Функция обЧислоВСчет(Знач Парам) Экспорт
	
	// в РН.Счет не хранится симв. представление счета
	// Парам - число - ресурс РН
	// 1  - "0:1"
	// 0  - ""
	// 21 - "2:1"
	
	Если Парам <=0 Тогда Возврат ""	КонецЕсли;
	
	Если Парам =99 Тогда Возврат "0-0"	КонецЕсли;
	
	Ч1 = Цел(Парам/10);	
	Ч2 = Парам-Ч1*10;
	Возврат Строка(Ч1)+"-"+Строка(Ч2)
	
КонецФункции // обЧислоВСчет()

Функция обПолучитьСписокСезонов(Сезон1, Сезон2)
	
	СписокСезонов = Новый СписокЗначений;
	Если Сезон1.Пустая() Или Сезон2.Пустая() Тогда
		Возврат Справочники.Сезоны.ПустаяСсылка()
	ИначеЕсли Сезон1 = Сезон2 Тогда
		СписокСезонов.Добавить(Сезон2);
		Возврат СписокСезонов
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сезоны.Ссылка КАК Сезон
	               |ИЗ
	               |	Справочник.Сезоны КАК Сезоны
	               |ГДЕ
	               |	Сезоны.ГодНачала >= &Код1
	               |	И Сезоны.ГодНачала <= &Код2
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сезоны.Код";
	
	Запрос.УстановитьПараметр("Код1", Сезон1.ГодНачала);
	Запрос.УстановитьПараметр("Код2", Сезон2.ГодНачала);
	
	Результат = Запрос.Выполнить();
	Выборка	=	Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСезонов.Добавить(Выборка.Сезон)
	КонецЦикла; 
	
	Возврат СписокСезонов
	
КонецФункции //

// таблицы

Функция обПолучитьТекущиеМестаКоманд(ГдеИгра = 1, Тур1 = 0, Тур2 = 0, Сезон = Неопределено, Кто = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	// ГдеИгра  -	1 - все (Д и В)
	// 				2 - Д, 3 - В
	Запрос.УстановитьПараметр("ГдеИгра", ГдеИгра - 1);
	
	Запрос.УстановитьПараметр("Тур1", Тур1);
	Запрос.УстановитьПараметр("Тур2", Тур2);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Команды.Кто КАК Кто,
	|	КОЛИЧЕСТВО(Игры.Тур) КАК Игр,
	|	СУММА(Игры.ВыигрОборот) КАК Выигр,
	|	СУММА(Игры.НичьиОборот) КАК Ничьи,
	|	СУММА(Игры.ПоражОборот) КАК Пораж,
	|	СУММА(Игры.МЗОборот) КАК МЗ,
	|	СУММА(Игры.МПОборот) КАК МП,
	|	СУММА(Игры.МЗОборот - Игры.МПОборот) КАК РазнМячей,
	|	СУММА(Игры.ОчкиОборот) КАК Очки,
	|	СУММА(Игры.ПОчкиОборот) КАК ПотерОчки
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ИгрыОбщ.Кто КАК Кто
	|	ИЗ
	|		РегистрНакопления.Игры КАК ИгрыОбщ
	|	ГДЕ
	|		ИгрыОбщ.Сезон = &Сезон) КАК Команды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Игры.Обороты(
	|				,
	|				,
	|				,
	|				Сезон = &Сезон
	|					И ВЫБОР
	|						КОГДА &ГдеИгра = 0
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ГдеИгра = &ГдеИгра
	|					КОНЕЦ
	|					И ВЫБОР
	|						КОГДА &Тур1 = 0
	|								И &Тур2 = 0
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ Тур МЕЖДУ &Тур1 И &Тур2
	|					КОНЕЦ) КАК Игры
	|		ПО Команды.Кто.Ссылка = Игры.Кто
	|
	|СГРУППИРОВАТЬ ПО
	|	Команды.Кто
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очки УБЫВ,
	|	Выигр УБЫВ,
	|	РазнМячей УБЫВ,
	|	МЗ УБЫВ,
	|	Команды.Кто.Наименование";

	Если Сезон = Неопределено Тогда
		Сезон	= Константы.ТекущийСезон.Получить();
	КонецЕсли;
	Запрос.УстановитьПараметр("Сезон", Сезон);

	тзВрем = Запрос.Выполнить().Выгрузить();

	тзВрем.Колонки.Добавить("Группа",	Новый ОписаниеТипов("Число"));	// по заполненным - требуется проверка
	тзВрем.Колонки.Добавить("НПП",		Новый ОписаниеТипов("Число"));  // м.б. перестановки при проверке
	тзВрем.Колонки.Добавить("Место12",	Новый ОписаниеТипов("Число"));	// н-ко команд могут иметь совершенно одинаковые показатели и занимать одинаковое место
	
	// С сезона 2017-2018 в случае равенства очков у двух и более команд места команд  в таблице Чемпионата определяются:
	// - по результатам игр между собой (число очков, количество побед, разность забитых и пропущенных мячей, число забитых мячей, число забитых мячей на чужом поле);
	// - по наибольшему числу побед во всех Матчах;
	// - по лучшей разности забитых и пропущенных мячей во всех Матчах;
	// - по наибольшему числу забитых мячей во всех Матчах;
	// - по наибольшему числу мячей, забитых на чужих полях во всех Матчах.	
	
	НомерГруппы = 1; флТребуетПроверки = Ложь;	флГруппа = Ложь;
	Для каждого стр Из тзВрем Цикл
		НомерСтроки = тзВрем.Индекс(стр);
		стр.НПП = НомерСтроки;
		стр.Место12 = НомерСтроки + 1;	// 1..n
		
		Если НомерСтроки = 0 Тогда Продолжить	КонецЕсли;
		
		// с сезона 2017-2018
		Если стр.Очки = тзВрем[НомерСтроки-1].Очки И (Сезон.ГодНачала > Дата(2017, 1, 1) Или стр.Выигр = тзВрем[НомерСтроки-1].Выигр) Тогда
			тзВрем[НомерСтроки-1].Группа = НомерГруппы;
			стр.Группа = НомерГруппы;
			флТребуетПроверки = Истина;
			флГруппа = Истина;
			
			Если стр.Выигр = тзВрем[НомерСтроки-1].Выигр И стр.РазнМячей = тзВрем[НомерСтроки-1].РазнМячей И стр.МЗ = тзВрем[НомерСтроки-1].МЗ Тогда
				стр.Место12 = тзВрем[НомерСтроки-1].Место12
			КонецЕсли;
		Иначе
			Если флГруппа Тогда
				НомерГруппы = НомерГруппы + 1;
			КонецЕсли;	
			флГруппа = Ложь
		КонецЕсли;	
	КонецЦикла;
	
	Если Не флТребуетПроверки Тогда
		Возврат тзВрем
	КонецЕсли;
	
	// проверить, если необходимо - переставить
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз1.Кто КАК Команда,
	               |	тз1.Группа КАК Группа,
	               |	тз1.НПП КАК НПП
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	&тзз КАК тз1
	               |ГДЕ
	               |	тз1.Группа > 0";
	
	// до установки параметров
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("тзз", тзВрем);
	Запрос.Выполнить(); // получить временную таблицу вт
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	вт.Группа КАК Группа,
	                |	вт.НПП КАК НПП,
	                |	вт.Команда КАК Команда
	                |ИЗ
	                |	вт КАК вт
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Группа,
	                |	НПП
	                |ИТОГИ ПО
	                |	Группа";
	
	// до установки параметров
	Запрос2.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	Результат = Запрос2.Выполнить();
	ВыборкаГруппы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ГруппаПред = Неопределено;
	Пока ВыборкаГруппы.Следующий() Цикл
		
		тзКомандыРанги = Новый ТаблицаЗначений;
		тзКомандыРанги.Колонки.Добавить("Команда", Новый ОписаниеТипов("СправочникСсылка.Команды"));
		тзКомандыРанги.Колонки.Добавить("ПорядковыйНомер", Новый ОписаниеТипов("Число"));
		
		Выборка = ВыборкаГруппы.Выбрать();
		Ранг = 0;
		Пока Выборка.Следующий() Цикл
			стрТз = тзКомандыРанги.Добавить();
			стрТз.Команда			= Выборка.Команда;
			стрТз.ПорядковыйНомер	= Ранг;
			Ранг	= Ранг + 1;
		КонецЦикла;
		// сз на доработку
		тзК = обРасставитьКомандыПоРангу(тзКомандыРанги, Тур1, Тур2, Сезон);
		Если Не тзК.Пустой() Тогда
			тзК = тзК.Выгрузить();
			Если тзК.Количество() = тзКомандыРанги.Количество() Тогда
				// смысл анализировать есть, если они ВСЕ встречались между собой
				
				// не изменился ли порядок
				// если показатели абсолютно одинаковы - все ОК, общие показатели уже в норме, осталось МЗвыезд(общ)
				сч = 0; ЕстьИзменения = Ложь;
				Для каждого стр Из тзКомандыРанги Цикл
					Если сч = 0 Тогда
						НППервой = тзВрем.Найти(стр.Команда, "Кто").НПП
					КонецЕсли;
					Если стр.Команда <> тзК[сч].Команда Тогда
						ЕстьИзменения = Истина; Прервать;
					КонецЕсли;
					сч = сч + 1;
				КонецЦикла;
				
				сч = 0;
				Если ЕстьИзменения Тогда
					// внести изменения в основную тз
					Для каждого стр Из тзК Цикл
						текК = тзВрем.Найти(стр.Команда, "Кто");
						текК.НПП = НППервой + сч;
						сч = сч + 1;
						// делить место они уже не могут
						текК.Место12 = НППервой + сч;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	тзВрем.Сортировать("НПП");
	Возврат тзВрем;
	
КонецФункции

Функция обПолучитьТекущиеМестаСоперниковКоманды(Команда, ГдеИгра = 1, Сезон1, Сезон2 = Неопределено, Тур1 = 0, Тур2 = 0) Экспорт
	
	Если Команда.Пустая() Тогда
	
		Возврат Новый ТаблицаЗначений
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// параметр Команда
	// возвращает таблицу результатов ее игр с соперниками
	Запрос.УстановитьПараметр("ГдеИгра", ГдеИгра - 1);
	Запрос.УстановитьПараметр("Команда", Команда);
	
	Запрос.УстановитьПараметр("Тур1", Тур1);
	Запрос.УстановитьПараметр("Тур2", Тур2);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Игры.СКем КАК Команда,
	|	КОЛИЧЕСТВО(Игры.Тур) КАК Игр,
	|	СУММА(Игры.ВыигрОборот) КАК Выигр,
	|	СУММА(Игры.НичьиОборот) КАК Ничьи,
	|	СУММА(Игры.ПоражОборот) КАК Пораж,
	|	СУММА(Игры.МЗОборот) КАК МЗ,
	|	СУММА(Игры.МПОборот) КАК МП,
	|	СУММА(Игры.МЗОборот - Игры.МПОборот) КАК РазнМячей,
	|	СУММА(Игры.ОчкиОборот) КАК Очки,
	|	СУММА(Игры.ПОчкиОборот) КАК ПотерОчки
	|ИЗ
	|	РегистрНакопления.Игры.Обороты(
	|			,
	|			,
	|			,
	|			Кто = &Команда
	|				И ВЫБОР
	|					КОГДА &флВсеСезоны
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Сезон В (&Сезоны)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ГдеИгра = 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ГдеИгра = &ГдеИгра
	|				КОНЕЦ) КАК Игры
	|
	|СГРУППИРОВАТЬ ПО
	|	Игры.СКем
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очки УБЫВ,
	|	Выигр УБЫВ,
	|	РазнМячей УБЫВ,
	|	МЗ УБЫВ";

	Если Сезон1 = Неопределено Тогда
		Сезон	= Константы.ТекущийСезон.Получить();
	КонецЕсли;
	Если Сезон2 = Неопределено Тогда
		Сезон2	= Сезон1;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("флВсеСезоны", Сезон1.Пустая() Или Сезон2.Пустая());
	Запрос.УстановитьПараметр("Сезоны", обПолучитьСписокСезонов(Сезон1, Сезон2));

	тзВрем = Запрос.Выполнить().Выгрузить();

	Возврат тзВрем;
	
КонецФункции


// "внутри" группы испытуемых команд

Функция обРасставитьКомандыПоРангу(СписокКоманд, Тур1 = 0, Тур2 = 0, Сезон)

	// проверить, если необходимо - исправить
	ЗапросВТ = Новый Запрос;
	ЗапросВТ.Текст = "ВЫБРАТЬ
	                 |	тз1.Команда КАК Команда,
	                 |	тз1.ПорядковыйНомер
	                 |ПОМЕСТИТЬ вт
	                 |ИЗ
	                 |	&тзз КАК тз1";
	
	// до установки параметров
	ЗапросВТ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросВТ.УстановитьПараметр("тзз", СписокКоманд);
	ЗапросВТ.Выполнить(); // получить временную таблицу вт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Игры.Кто КАК Команда,
	|	КОЛИЧЕСТВО(Игры.Тур) КАК Игр,
	|	СУММА(Игры.ВыигрОборот) КАК Выигр,
	|	СУММА(Игры.МЗОборот) КАК МЗ,
	|	СУММА(ВЫБОР
	|			КОГДА Игры.ГдеИгра = 2
	|				ТОГДА Игры.МЗОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МВыезд,
	|	СУММА(Игры.МЗОборот - Игры.МПОборот) КАК РазнМячей,
	|	СУММА(Игры.ОчкиОборот) КАК Очки,
	|	СписокКоманд.ПорядковыйНомер КАК ПорядковыйНомер
	|ИЗ
	|	РегистрНакопления.Игры.Обороты(
	|			,
	|			,
	|			,
	|			Сезон = &Сезон
	|				И Кто В (&СписокКоманд)
	|				И СКем В (&СписокКоманд)
	|				И ВЫБОР
	|					КОГДА &Тур1 = 0
	|							И &Тур2 = 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Тур МЕЖДУ &Тур1 И &Тур2
	|				КОНЕЦ) КАК Игры
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК СписокКоманд
	|		ПО Игры.Кто = СписокКоманд.Команда
	|
	|СГРУППИРОВАТЬ ПО
	|	Игры.Кто,
	|	СписокКоманд.ПорядковыйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очки УБЫВ,
	|	Выигр УБЫВ,
	|	РазнМячей УБЫВ,
	|	МЗ УБЫВ,
	|	МВыезд УБЫВ,
	|	ПорядковыйНомер";	
	
	Запрос.МенеджерВременныхТаблиц = ЗапросВТ.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокКоманд", СписокКоманд);
	Запрос.УстановитьПараметр("Сезон", Сезон);

	Запрос.УстановитьПараметр("Тур1", Тур1);
	Запрос.УстановитьПараметр("Тур2", Тур2);
	
	Результат = Запрос.Выполнить();
	Возврат Результат;

КонецФункции

Функция обПолучитьТекущиеМестаГруппыКоманд(ГдеИгра = 1, Тур1 = 0, Тур2 = 0, Сезон = Неопределено, ГруппаКоманд = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	// ГдеИгра  -	1 - все (Д и В)
	// 				2 - Д, 3 - В
	Запрос.УстановитьПараметр("ГдеИгра", ГдеИгра - 1);
	
	Запрос.УстановитьПараметр("Тур1", Тур1);
	Запрос.УстановитьПараметр("Тур2", Тур2);
	
	Запрос.УстановитьПараметр("ГруппаКоманд", ГруппаКоманд);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Игры.Кто КАК Кто,
	|	КОЛИЧЕСТВО(Игры.Тур) КАК Игр,
	|	СУММА(Игры.ВыигрОборот) КАК Выигр,
	|	СУММА(Игры.НичьиОборот) КАК Ничьи,
	|	СУММА(Игры.ПоражОборот) КАК Пораж,
	|	СУММА(Игры.МЗОборот) КАК МЗ,
	|	СУММА(Игры.МПОборот) КАК МП,
	|	СУММА(Игры.МЗОборот - Игры.МПОборот) КАК РазнМячей,
	|	СУММА(Игры.ОчкиОборот) КАК Очки,
	|	СУММА(Игры.ПОчкиОборот) КАК ПотерОчки
	|ИЗ
	|	РегистрНакопления.Игры.Обороты(
	|			,
	|			,
	|			,
	|			Сезон = &Сезон
	|				И Кто В (&ГруппаКоманд)
	|				//И СКем В (&ГруппаКоманд)
	|				И ВЫБОР
	|					КОГДА &ГдеИгра = 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ГдеИгра = &ГдеИгра
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Тур1 = 0
	|							И &Тур2 = 0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Тур МЕЖДУ &Тур1 И &Тур2
	|				КОНЕЦ) КАК Игры
	|
	|СГРУППИРОВАТЬ ПО
	|	Игры.Кто
	|
	|УПОРЯДОЧИТЬ ПО
	|	Очки УБЫВ,
	|	Выигр УБЫВ,
	|	РазнМячей УБЫВ,
	|	МЗ УБЫВ";

	Если Сезон = Неопределено Тогда
		Сезон	= Константы.ТекущийСезон.Получить();
	КонецЕсли;
	Запрос.УстановитьПараметр("Сезон", Сезон);

	тзВрем = Запрос.Выполнить().Выгрузить();

	тзВрем.Колонки.Добавить("Группа", Новый ОписаниеТипов("Число"));	// по заполненным - требуется проверка
	тзВрем.Колонки.Добавить("НПП", Новый ОписаниеТипов("Число"));
	тзВрем.Колонки.Добавить("Место12",	Новый ОписаниеТипов("Число"));	// н-ко команд могут иметь совершенно одинаковые показатели и занимать одинаковое место
	
	НомерГруппы = 1; флТребуетПроверки = Ложь;	флГруппа = Ложь;
	Для каждого стр Из тзВрем Цикл
		НомерСтроки = тзВрем.Индекс(стр);
		стр.НПП = НомерСтроки;
		Если НомерСтроки = 0 Тогда Продолжить	КонецЕсли;
		Если стр.Очки = тзВрем[НомерСтроки-1].Очки и стр.Выигр = тзВрем[НомерСтроки-1].Выигр Тогда
			тзВрем[НомерСтроки-1].Группа = НомерГруппы;
			стр.Группа = НомерГруппы;
			флТребуетПроверки = Истина;
			флГруппа = Истина
		Иначе
			Если флГруппа Тогда
				НомерГруппы = НомерГруппы + 1;
			КонецЕсли;	
			флГруппа = Ложь
		КонецЕсли;	
	КонецЦикла;
	
	Если Не флТребуетПроверки Тогда
		Возврат тзВрем
	КонецЕсли;
	
	// проверить, если необходимо - исправить
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	тз1.Кто КАК Команда,
	               |	тз1.Группа КАК Группа,
	               |	тз1.НПП КАК НПП
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	&тзз КАК тз1
	               |ГДЕ
	               |	тз1.Группа > 0";
	
	// до установки параметров
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("тзз", тзВрем);
	Запрос.Выполнить(); // получить временную таблицу вт
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	вт.Группа КАК Группа,
	                |	вт.НПП КАК НПП,
	                |	вт.Команда КАК Команда
	                |ИЗ
	                |	вт КАК вт
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Группа,
	                |	НПП
	                |ИТОГИ ПО
	                |	Группа";
	
	// до установки параметров
	Запрос2.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	Результат = Запрос2.Выполнить();
	ВыборкаГруппы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ГруппаПред = Неопределено;
	Пока ВыборкаГруппы.Следующий() Цикл
		
		тзКомандыРанги = Новый ТаблицаЗначений;
		тзКомандыРанги.Колонки.Добавить("Команда", Новый ОписаниеТипов("СправочникСсылка.Команды"));
		тзКомандыРанги.Колонки.Добавить("ПорядковыйНомер", Новый ОписаниеТипов("Число"));
		
		Выборка = ВыборкаГруппы.Выбрать();
		Ранг = 0;
		Пока Выборка.Следующий() Цикл
			стрТз = тзКомандыРанги.Добавить();
			стрТз.Команда			= Выборка.Команда;
			стрТз.ПорядковыйНомер	= Ранг;
			Ранг	= Ранг + 1;
		КонецЦикла;
		// сз на доработку
		тзК = обРасставитьКомандыПоРангу(тзКомандыРанги, Тур1, Тур2, Сезон);
		Если Не тзК.Пустой() Тогда
			тзК = тзК.Выгрузить();
			Если тзК.Количество() = тзКомандыРанги.Количество() Тогда
				// смысл анализировать есть, если они ВСЕ встречались между собой
				
				// не изменился ли порядок
				// если показатели абсолютно одинаковы - все ОК, общие показатели уже в норме, осталось МЗвыезд(общ)
				сч = 0; ЕстьИзменения = Ложь;
				Для каждого стр Из тзКомандыРанги Цикл
					Если сч = 0 Тогда
						НППервой = тзВрем.Найти(стр.Команда, "Кто").НПП
					КонецЕсли;
					Если стр.Команда <> тзК[сч].Команда Тогда
						ЕстьИзменения = Истина; Прервать;
					КонецЕсли;
					сч = сч + 1;
				КонецЦикла;
				
				сч = 0;
				Если ЕстьИзменения Тогда
					// внести изменения в основной тз
					Для каждого стр Из тзК Цикл
						текК = тзВрем.Найти(стр.Команда, "Кто");
						текК.НПП = НППервой + сч;
						//тз1.Сдвинуть(КомандаТЗ1, НомерВтз - сч);
						сч = сч + 1;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	тзВрем.Сортировать("НПП");

	Возврат тзВрем;
	
КонецФункции

Функция обПолучитьКоличествоКомандВСезоне(Сезон = Неопределено) Экспорт
	
	Количество = 0;
	Запрос = Новый Запрос;
	
	Если Сезон = Неопределено Тогда
		Сезон	= Константы.ТекущийСезон.Получить();
	КонецЕсли;
	Запрос.УстановитьПараметр("Сезон", Сезон);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Влож.Сезон,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Влож.Команда) КАК Команда
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		1 КАК Сезон,
	               |		Игры.Кто КАК Команда
	               |	ИЗ
	               |		РегистрНакопления.Игры КАК Игры
	               |	ГДЕ
	               |		Игры.Сезон = &Сезон) КАК Влож
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Влож.Сезон";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Количество = Выборка.Команда
	КонецЕсли;	
	
	Возврат Количество;
	
КонецФункции

Функция обПолучитьКоличествоТуровВСезоне(Сезон = Неопределено) Экспорт
	
	КоличествоКомандВСезоне = обПолучитьКоличествоКомандВСезоне(Сезон);
	
	КоличествоТуровВСезоне = ?(КоличествоКомандВСезоне = 0, 0, 2 * (КоличествоКомандВСезоне - 1));
	Возврат КоличествоТуровВСезоне
	
КонецФункции

Функция обПоследние5ИгрКоманды(Команда, Гость = Неопределено, ГдеИгра = 0, ОбратныйПорядок = Истина, ПоТур = 0, Сезон = Неопределено) Экспорт 

		// получить последние (5) игры команд ХГ
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5
	               |	ИгрыОбороты.Сезон,
	               |	ИгрыОбороты.Тур,
	               |	ИгрыОбороты.Дата КАК Дата,
	               |	ИгрыОбороты.СКем КАК Соперник,
	               |	ИгрыОбороты.ГдеИгра,
	               |	ИгрыОбороты.СчетОборот,
	               |	ИгрыОбороты.ВыигрОборот КАК Выигр,
	               |	ИгрыОбороты.НичьиОборот КАК Ничья,
	               |	ИгрыОбороты.ПоражОборот КАК Пораж,
	               |	ИгрыОбороты.МЗОборот,
	               |	ИгрыОбороты.МПОборот,
	               |	ИгрыОбороты.ОчкиОборот
	               |ПОМЕСТИТЬ вт5
	               |ИЗ
	               |	РегистрНакопления.Игры.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Кто = &Команда
	               |				И ВЫБОР
	               |					КОГДА &Соперник = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ СКем = &Соперник
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ГдеИгра = 0
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ГдеИгра = &ГдеИгра
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &Сезон = НЕОПРЕДЕЛЕНО
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Сезон = &Сезон
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ПоТур = 0
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Тур <= &ПоТур
	               |				КОНЕЦ) КАК ИгрыОбороты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт5.Сезон,
	               |	вт5.Тур,
	               |	вт5.Дата КАК Дата,
	               |	вт5.Соперник,
	               |	вт5.ГдеИгра,
	               |	вт5.СчетОборот,
	               |	вт5.Выигр,
	               |	вт5.Ничья,
	               |	вт5.Пораж,
	               |	вт5.МЗОборот,
	               |	вт5.МПОборот,
	               |	вт5.ОчкиОборот
	               |ИЗ
	               |	вт5 КАК вт5
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
				   
	Если ОбратныйПорядок Тогда
	
		Запрос.Текст = Запрос.Текст + " УБЫВ"
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Команда", Команда);
	Запрос.УстановитьПараметр("Соперник", Гость);
	Запрос.УстановитьПараметр("ГдеИгра", ГдеИгра);
	Запрос.УстановитьПараметр("Сезон", Сезон);
	Запрос.УстановитьПараметр("ПоТур", ПоТур);
	
	Результат = Запрос.Выполнить();
    Возврат Результат

КонецФункции // обПоследние5ИгрКоманды()

Функция обПоследнийСыгранныйТурСезона(Сезон) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ИгрыОбороты.Тур) КАК Тур
	               |ИЗ
	               |	РегистрНакопления.Игры.Обороты(, , , Сезон = &Сезон) КАК ИгрыОбороты";
	
	Запрос.УстановитьПараметр("Сезон", Сезон);
	
	Результат = Запрос.Выполнить();
	
	ПоследнийТурСезона = 0;
	Если Не Результат.Пустой() Тогда
    	Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ПоследнийТурСезона = ?(Выборка.Тур = Null, 0, Выборка.Тур)
		КонецЕсли;	
	КонецЕсли;	

	Возврат ПоследнийТурСезона
	
КонецФункции // обПоследнийСыгранныйТурСезона()
